[
    {
        "word": "Dab",
        "meaning": "To lightly touch or apply something with quick, gentle strokes.",
        "example": "Dora decided to dab beetroot on her lips instead of lipstick.",
        "example_in_tamil": "உதட்டுச்சாயத்திற்கு பதிலாக, தன் உதடுகளில் செங்கிழங்கை தடவ டோரா முடிவுசெய்தாள்.",
        "meaning_in_tamil": "மெல்ல தடவு"
    },
    {
        "word": "Dabble",
        "meaning": "To take part in an activity in a casual or superficial way.",
        "example": "Ari used to dabble in cooking on weekends and no one eats the food he cooks.",
        "example_in_tamil": "வாரமுடிவு நாட்களில், அரி சமையலில் மேலோட்டமாக ஈடுபடுவதுண்டு. மேலும், அவன் சமைக்கும் உணவை யாரும் உண்பதில்லை.",
        "meaning_in_tamil": "ஒர abundance கல் fullளாக ஈடுபடாமல், சிறிது மட்டும் பங்காற்று"
    },
    {
        "word": "Dab Hand",
        "meaning": "A person who is very skilled at something.",
        "example": "Karan is a dab hand at React and Flutter, so everyone in the company turns to him with their doubts.",
        "example_in_tamil": "கரண், React மற்றும் Flutter முதலானவற்றில் கைதேர்ந்தவன் என்பதால், நிறுவனத்திலுள்ள யாவரும் தங்கள் சந்தேகங்களோடு, அவனிடமே செல்கின்றனர்.",
        "meaning_in_tamil": "ஒர abundance கல் கைதேர்ந்த ஒருவர்"
    },
    {
        "word": "Daffy",
        "meaning": "Silly or foolish.",
        "example": "Deva’s daffy approach to studying, like reading comic books instead of his notes, might explain why he got low marks—16 out of 30.",
        "example_in_tamil": "குறிப்புகளை விட்டுவிட்டு, கதை புத்தகங்களை படித்த தேவாவின் சில்லறைத்தனமான படிப்பு முறையே, அவன் ஏன் 30க்கு, 16 மதிப்பெண்கள் எடுத்தான் என்பதற்கு விளக்கம் சொல்லும்.",
        "meaning_in_tamil": "சில்லறைத்தனமான"
    },
    {
        "word": "Daft",
        "meaning": "Silly or foolish.",
        "example": "It was a daft idea to go hiking in the month of Karthigai without checking the weather forecast first.",
        "example_in_tamil": "வானிலை கணிப்பை கவனியாமல், கார்த்திகை மாதத்தில், வெளியே நடக்கச் செல்வது, ஒரு முட்டாள்தனமான யோசனை.",
        "meaning_in_tamil": "சில்லறைத்தனமான / முட்டாள்தனமான"
    }
]
